RRN_Data/1000900/1000900.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Body><d2LogicalModel xmlns="http://datex2.eu/schema/2/2_0" modelBaseVersion="2"><exchange><supplierIdentification><country>fr</country><nationalIdentifier>Tipi</nationalIdentifier></supplierIdentification><subscription><operatingMode>operatingMode1</operatingMode><subscriptionStartTime>2023-04-07T21:49:50.724+02:00</subscriptionStartTime><subscriptionState>active</subscriptionState><updateMethod>allElementUpdate</updateMethod><target><address/><protocol/></target></subscription></exchange><payloadPublication xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="SituationPublication" lang="fr"><publicationTime>2023-04-07T21:49:50.724+02:00</publicationTime><publicationCreator><country>fr</country><nationalIdentifier>Tipi</nationalIdentifier></publicationCreator><situation id="230407-002477" version="1"><overallSeverity>medium</overallSeverity><situationVersionTime>2023-04-07T21:49:50.055+02:00</situationVersionTime><headerInformation><confidentiality>noRestriction</confidentiality><informationStatus>real</informationStatus></headerInformation><situationRecord xsi:type="MaintenanceWorks" id="230407-002477-1" version="1"><situationRecordCreationReference>frmar-230407-151877-frmar-230407-170824</situationRecordCreationReference><situationRecordCreationTime>2023-04-07T21:49:47.765+02:00</situationRecordCreationTime><situationRecordObservationTime>2023-04-07T21:49:47.765+02:00</situationRecordObservationTime><situationRecordVersionTime>2023-04-07T21:49:50.055+02:00</situationRecordVersionTime><situationRecordFirstSupplierVersionTime>2023-04-07T21:49:47.765+02:00</situationRecordFirstSupplierVersionTime><probabilityOfOccurrence>certain</probabilityOfOccurrence><source><sourceIdentification>Direction interdépartementale des routes/DIR Méditerranée</sourceIdentification><reliable>true</reliable></source><validity><validityStatus>definedByValidityTimeSpec</validityStatus><validityTimeSpecification><overallStartTime>2023-04-07T21:49:07.750+02:00</overallStartTime></validityTimeSpecification></validity><impact><numberOfLanesRestricted>1</numberOfLanesRestricted><originalNumberOfLanes>2</originalNumberOfLanes></impact><generalPublicComment><comment><values><value lang="fr">DIR Méditerranée/District Urbain/CAM</value></values></comment><commentType>locationDescriptor</commentType></generalPublicComment><generalPublicComment><comment><values><value lang="fr">Voie rapide neutralisée</value></values></comment><commentType>description</commentType></generalPublicComment><generalPublicComment><comment><values><value lang="fr">Point particulier : début : situé 66 m au sud de Aire de Vitrolles, fin : situé 127 m au nord de Vitrolles</value></values></comment><commentType>locationDescriptor</commentType></generalPublicComment><generalPublicComment><comment><values><value lang="fr">De Lyon vers Marseille</value></values></comment><commentType>locationDescriptor</commentType></generalPublicComment><groupOfLocations xsi:type="Linear"><tpegLinearLocation><tpegDirection>southBound</tpegDirection><tpegLinearLocationType>segment</tpegLinearLocationType><to xsi:type="TpegNonJunctionPoint"><pointCoordinates><latitude>43.441193</latitude><longitude>5.2478814</longitude></pointCoordinates><name><descriptor><values><value lang="fr">Vitrolles</value></values></descriptor><tpegOtherPointDescriptorType>townName</tpegOtherPointDescriptorType></name><name><descriptor><values><value lang="fr">A7</value></values></descriptor><tpegOtherPointDescriptorType>linkName</tpegOtherPointDescriptorType></name></to><from xsi:type="TpegNonJunctionPoint"><pointCoordinates><latitude>43.443222</latitude><longitude>5.245466</longitude></pointCoordinates><name><descriptor><values><value lang="fr">Vitrolles</value></values></descriptor><tpegOtherPointDescriptorType>townName</tpegOtherPointDescriptorType></name><name><descriptor><values><value lang="fr">A7</value></values></descriptor><tpegOtherPointDescriptorType>linkName</tpegOtherPointDescriptorType></name></from></tpegLinearLocation><alertCLinear xsi:type="AlertCMethod4Linear"><alertCLocationCountryCode>F</alertCLocationCountryCode><alertCLocationTableNumber>32</alertCLocationTableNumber><alertCLocationTableVersion>11.0</alertCLocationTableVersion><alertCDirection><alertCDirectionCoded>positive</alertCDirectionCoded></alertCDirection><alertCMethod4PrimaryPointLocation><alertCLocation><alertCLocationName><values><value lang="fr">Vitrolles</value></values></alertCLocationName><specificLocation>37001</specificLocation></alertCLocation><offsetDistance><offsetDistance>127</offsetDistance></offsetDistance></alertCMethod4PrimaryPointLocation><alertCMethod4SecondaryPointLocation><alertCLocation><alertCLocationName><values><value lang="fr">Aire de Vitrolles</value></values></alertCLocationName><specificLocation>11509</specificLocation></alertCLocation><offsetDistance><offsetDistance>66</offsetDistance></offsetDistance></alertCMethod4SecondaryPointLocation></alertCLinear><linearWithinLinearElement><directionRelativeOnLinearSection>aligned</directionRelativeOnLinearSection><linearElement><roadNumber>A0007</roadNumber></linearElement><fromPoint xsi:type="DistanceFromLinearElementReferent"><distanceAlong>700.0</distanceAlong><fromReferent><referentIdentifier>13PR260D</referentIdentifier><referentType>referenceMarker</referentType></fromReferent></fromPoint><toPoint xsi:type="DistanceFromLinearElementReferent"><distanceAlong>400.0</distanceAlong><fromReferent><referentIdentifier>13PR260D</referentIdentifier><referentType>referenceMarker</referentType></fromReferent></toPoint></linearWithinLinearElement></groupOfLocations><situationRecordExtension><situationRecordExtendedApproved><safetyRelatedMessage>false</safetyRelatedMessage></situationRecordExtendedApproved></situationRecordExtension><roadMaintenanceType>roadworks</roadMaintenanceType></situationRecord></situation></payloadPublication></d2LogicalModel></soap:Body></soap:Envelope>